app/controllers/bands_controller.rb

SELECT * FROM "bands" ORDER BY bbq_id desc
SELECT * FROM "bbqs" ORDER BY id desc
---
  def index
    @bands = Band.all(:order=>"bbq_id desc")
    @bbqs = Bbq.all(:order=>"id desc")

SELECT * FROM "bands" WHERE ("bands"."id" = 0)
---
  def show
    @band = Band.find(params[:id])

SELECT * FROM "bands" WHERE ("bands"."id" = 1)
---
  def edit
    @band = Band.find(params[:id])

INSERT INTO "bands" ("name", "updated_at", "day_id", "sort_order", "play_date", "bbq_id", "created_at", "start_time", "end_time") VALUES('thirst', '2010-10-12 04:27:25', 5, NULL, NULL, NULL, '2010-10-12 04:27:25', '12:45 pm', '1:45 pm')
---
  def create
    @band = Band.new(params[:band])

    respond_to do |format|
      if @band.save

SELECT * FROM "bands" WHERE ("bands"."id" = 1)
UPDATE "bands" SET "play_date" = '2010-10-15', "updated_at" = '2010-10-11 06:20:23' WHERE "id" = 1
---
  def update
    @band = Band.find(params[:id])

    respond_to do |format|
      if @band.update_attributes(params[:band])

SELECT * FROM "bands" WHERE ("bands"."id" = 12)
DELETE FROM "bands" WHERE "id" = 12
---
  def destroy
    @band = Band.find(params[:id])
    @band.destroy