app/controllers/bbqs_controller.rb

SELECT * FROM "bbqs"
---
  def index
    @bbqs = Bbq.all

SELECT * FROM "bbqs" WHERE ("bbqs"."id" = 0)
---
  def show
    @bbq = Bbq.find(params[:id])

SELECT * FROM "bbqs" WHERE ("bbqs"."id" = 1)
---
  def edit
    @bbq = Bbq.find(params[:id])

INSERT INTO "bbqs" ("updated_at", "title", "is_published", "venue_id", "content", "event_date", "created_at") VALUES('2010-10-11 06:19:21', 'Chicago BBQ', 't', 1, '<p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Vivamus non tellus vel dui lobortis tempor ut ut massa. Proin et tellus nisl. Donec non metus ac augue egestas malesuada non vitae sapien. Duis et augue eget erat porttitor tincidunt nec vitae felis. Cras ut mi sed eros volutpat placerat. <a href="#">Praesent sed arcu id</a> neque viverra mollis. Fusce adipiscing est at ipsum vulputate non faucibus magna interdum. Maecenas tortor magna, rutrum vel pulvinar at, mollis in lacus.</p>', '2010-10-15', '2010-10-11 06:19:21')
---
  def create
    @bbq = Bbq.new(params[:bbq])


    respond_to do |format|
      if @bbq.save

SELECT * FROM "bbqs" WHERE ("bbqs"."id" = 1)
UPDATE "bbqs" SET "is_published" = 't', "updated_at" = '2010-10-12 04:28:53' WHERE "id" = 8
---
  def update
    @bbq = Bbq.find(params[:id])

    respond_to do |format|
      if @bbq.update_attributes(params[:bbq])

SELECT * FROM "bbqs" WHERE ("bbqs"."id" = 3)
DELETE FROM "bbqs" WHERE "id" = 3
---
  def destroy
    @bbq = Bbq.find(params[:id])
    @bbq.destroy