app/controllers/news_controller.rb

  def home
    @articles = Article.all(:order => "created_at DESC, id DESC")
---
SELECT * FROM "articles" WHERE (event_date >= '2010-09-28' and tickets_available = 't') ORDER BY created_at DESC, id DESC

  def present
    @articles = Article.find(:all, :conditions=>["event_date >= ?", Date.today], :order => "created_at DESC, id DESC")
---
SELECT * FROM "articles" WHERE (event_date >= '2010-09-28') ORDER BY event_date DESC, id DESC

  def past
    @articles = Article.find(:all, :conditions=>["event_date < ?", Date.today], :order => "created_at DESC, id DESC")
---
SELECT * FROM "articles" WHERE (event_date >= '2010-09-28') ORDER BY event_date DESC, id DESC